movingBlock/movingBlock_St1.2/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions


(
    runApplication decomposePar
    runParallel $(getApplication)
    runApplication reconstructPar
    runApplication foamToVTK
    rm -r process*
)

#------------------------------------------------------------------------------
